In [1]:
# First we import the libraries 
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import warnings
warnings.filterwarnings("ignore")

In [2]:
# Import the data
train_data = pd.read_csv(r"C:\Users\Gaurav\Downloads\TitanicDataset\train.csv")
test_data = pd.read_csv(r"C:\Users\Gaurav\Downloads\TitanicDataset\test.csv")
result_data = pd.read_csv(r"C:/Users/Gaurav/Downloads/TitanicDataset/test_result.csv")

In [3]:
train_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
train_data.corr()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
PassengerId,1.000000,-0.005007,-0.035144,0.036847,-0.057527,-0.001652,0.012658
Survived,-0.005007,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307
Pclass,-0.035144,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500
Age,0.036847,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067
SibSp,-0.057527,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651
Parch,-0.001652,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225
Fare,0.012658,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000

In [6]:
train_data.shape

(891, 12)

In [7]:
test_data.shape

(418, 11)

In [8]:
result_data.shape

(418, 2)

In [9]:
Y= train_data["Survived"]

# Data Preprocssing

In [10]:
# What information do we need to find who will survive
x_train = train_data[["Pclass","Sex","Age","Fare","Embarked"]]

In [11]:
x_train.head()

   Pclass     Sex   Age     Fare Embarked
0       3    male  22.0   7.2500        S
1       1  female  38.0  71.2833        C
2       3  female  26.0   7.9250        S
3       1  female  35.0  53.1000        S
4       3    male  35.0   8.0500        S

In [12]:
x_train["Embarked"].isnull().sum()

2

In [13]:
x_train['Embarked'] = x_train['Embarked'].fillna('S') # Because s is comman values

In [14]:
x_train["Embarked"].isnull().sum()

0

In [15]:
x_train["Sex"].isnull().sum()

0

In [16]:
x_train["Age"].isnull().sum() # Now we have missing so inorder to fill the place we just need to take averagevalue

177

In [17]:
x_train['Age'] = x_train['Age'].fillna(x_train.Age.median())

In [18]:
x_train["Age"].isnull().sum()

0

In [19]:
x_train["Fare"].isnull().sum()

0

In [20]:
x_train["Pclass"].isnull().sum()

0

In [21]:
#So there is no remaining missing values.
x_train.head()

   Pclass     Sex   Age     Fare Embarked
0       3    male  22.0   7.2500        S
1       1  female  38.0  71.2833        C
2       3  female  26.0   7.9250        S
3       1  female  35.0  53.1000        S
4       3    male  35.0   8.0500        S

In [22]:
# Binning numerical columns
x_train['Age'] = pd.qcut(x_train.Age, q=4, labels=False )
x_train['Fare']= pd.qcut(x_train.Fare, q=4, labels=False)
x_train.head()

   Pclass     Sex  Age  Fare Embarked
0       3    male    0     0        S
1       1  female    3     3        C
2       3  female    1     1        S
3       1  female    2     3        S
4       3    male    2     1        S

In [23]:
#Now we are seeing that there are categorial variable so in order to train we need to changethem into integer values.
d = {'male':0,'female':1}
x_train["Sex"]= x_train["Sex"].apply(lambda x:d[x])

In [24]:
d = {'S':0,'C':1,'Q':2}
x_train["Embarked"]= x_train["Embarked"].apply(lambda x:d[x])

In [25]:
x_train.head()

   Pclass  Sex  Age  Fare  Embarked
0       3    0    0     0         0
1       1    1    3     3         1
2       3    1    1     1         0
3       1    1    2     3         0
4       3    0    2     1         0

# Spiliting the data

In [43]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test = train_test_split(x_train,Y,test_size=.33,random_state = 42)# we spli the data succesfully

# Build this model

In [44]:
# Now we need to train this model
#our model is SVM
from sklearn import svm
classifier = svm.LinearSVC()

In [46]:
classifier.fit(X_train,y_train)

LinearSVC(C=1.0, class_weight=None, dual=True, fit_intercept=True,
     intercept_scaling=1, loss='squared_hinge', max_iter=1000,
     multi_class='ovr', penalty='l2', random_state=None, tol=0.0001,
     verbose=0)

In [47]:
classifier.predict(X_test)

array([0, 0, 0, 1, 1, 1, 1, 0, 1, 1, 0, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0,
       1, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0,
       1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 1, 0, 1, 1, 1, 0, 1, 1, 0, 0, 1,
       0, 0, 0, 1, 1, 1, 0, 1, 0, 0, 1, 1, 1, 1, 0, 1, 1, 0, 0, 0, 1, 1,
       0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0,
       1, 0, 1, 0, 0, 0, 0, 0, 1, 1, 0, 1, 1, 0, 0, 0, 1, 0, 1, 0, 1, 0,
       0, 1, 0, 1, 1, 0, 0, 1, 0, 1, 0, 0, 1, 1, 0, 0, 1, 0, 0, 0, 0, 1,
       0, 0, 0, 1, 1, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 0, 0,
       1, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 1, 1, 0,
       1, 1, 0, 1, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 1, 0,
       0, 1, 0, 0, 0, 1, 0, 0, 1, 1, 0, 1, 0, 1, 0, 1, 1, 1, 1, 0, 0, 1,
       0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 1, 1, 0, 1, 0,
       0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0,
       1, 0, 0, 0, 0, 0, 1, 1, 0], dtype=int64)

In [48]:
predictions = classifier.predict(X_test)

In [49]:
from sklearn.metrics import confusion_matrix,classification_report
print(classification_report(y_test,predictions))

              precision    recall  f1-score   support

           0       0.81      0.86      0.83       175
           1       0.78      0.70      0.74       120

   micro avg       0.80      0.80      0.80       295
   macro avg       0.79      0.78      0.79       295
weighted avg       0.80      0.80      0.79       295

# Accuracy

In [50]:
100*classifier.score(X_train,y_train) #Accuracy

78.18791946308725